package 수요일;

public class // 클래스라는 것을 알려주는 자바 키워드
	클래스선언부_와_main메서드ㅡ세번째
	{

	public 
	static 
	void // 리턴 타입
	main(String[] args) { // 메서드명
		
	}
	/**
	 * main() 메서드 
	 * 메서드의 구조는 리턴 타입 메서드명() {} 형태를 띤다 다음 예에서 리턴 타입은 void 메서드명은 main인데
	 * 
	 * 메서드 원형 앞에 위치한 public은 접근 지정자 static은 정적 메서드를 나타내는 키워드 이다 여기서는 
	 * public static을 빨간 사과에서 빨간 처럼 메서드를 꾸며 주는 수식어 정도로만 그냥 public static한 메서드 라고
	 * 생각 하자 바이트 코드가 메서드 영역에서 로딩되면 자바 가상멋ㄴ은 main() 메서드부터 찾는다 따라서 실행 이후 가장 먼저 실행
	 * 되는 메서드가 main 메서드라는 것을 기억하기로 하자 
	 */

}
