package 연산자2026_08_03;

public class 연산자의_종류 {

	public static void main(String[] args) {
		/**
		 * 자바의 연산자는 연산결과에 따라 3가지로 나눌 수 있다. 
		 * 첫쨰: 연산 결과가 특정 갑이 나오는 산술,증감,비트,시프트 연산자
		 * 둘쨰: 연산 결과가 참 or 거짓중 하나의 값으로만 나타나는 비교,논리 연산자 
		 * 셋째: 값을 반환하는 것이 아닌 값을 대입하는 의미를 지니고 있는 대입 연산자와 삼항 연산자가 있다.
		 * 
		 * 산술연산자: +, -, *, /, % : 사칙연산 및 나머지 연산
		 * 증감연산자: ++,-- : 값이 1씩 증가 및 감소
		 * 비트연산자: &, |, ~, ^ : 비트 AND, OR, NOT, XOR
		 * 시프트연산자: >>, <<, >>> : 비트 단위로 이동
		 * 비교 연산자: <, >, <=, >=, ==, != : 값의 크기 비교
		 * 논리 연산자: &&. ||, !, ^ " 논리 AND, OR, NOT, XOR
		 * 대입 연산자: =, +=, -=, *=, /=, &=, |=, >>=, <<=. >>>= : 산술 연산 결과의 대입
		 * 삼항 연산자: (참 또는 거짓) ? x:y : 참일때 x 거짓일 때 y
		 */
	}

}
