package 월요일2026_08_17;

public class 클래스와_객체_구분하기 {

	public static void main(String[] args) {
		/**
		 * 클래스를 활용하는 방법은 본격적으로 다루기 전에 클래스와 객체의 개념을 구분할 수 있어야 한다.
		 * 클래스와 객체를 구분할 때 예시로 가장 많이 나오는 것이 붕어빵 기계다
		 * 
		 * 클래스를 붕어빵 기계에 비유한다면 객체는 붕어빵 기계로 찍어 낸 붕어빵에 비유할 수 있다.
		 * 우리가 붕어빵을 먹고 싶다고 해서 붕어빵 기계를 먹을 수는 없다.
		 * 붕어빵과 그 안에 든 앙꼬를 먹고 싶다면 붕어빵 기계에서 찍어 나온 붕어빵을 먹어야 한다.
		 * 이를 다시 클래스와 객체로 바꿔 설명해 보자. 
		 * 
		 * 우리는 클래스를 직접 사용할 수 없다. 클래스의 모든 특징(필드)과 기능(메서드)들을 사용하려면
		 * 클래스를 이용해 객체를 만든 후 그 객체 속의 필드와 메서드 등을 사용해야 하는 것이다.
		 * 클래스에서 객체를 만드는 과정은 생성자가 수행한다. 클래스의 생성자로 객체를 만드는 과정을
		 * 인스턴스화 라고 하고 인스턴스화로 만들어진 객체를 인스턴스 라고 한다.
		 * 객체(붕어빵) 속에는 클래스의 내부 구성 요소 중 생성자를 제외한 나머지 요소가 포함돼 있는데
		 * 이를 인스턴스 멤버 라고 한다. 이 시점에서 클래스는 바로 사용할 수 없고 반드시 객체를 생성해
		 * 객체 안에 있는 필드 메서드 및 이너 클래스를 사용해야 한다.
		 */
	}

}
