package 토2026_09_26_2;


/**
 * 디폴트 메서드가 인터페이스 내부에 속하는 일반 클래스처럼 동작한다고 했으므로 자식 클래스에서
 * 부모 인터페이스 내부에 디폴트 메서드도 호출할 수 있다. 자식 클래스 메서드 내부에서
 * 부모 인터페이스의 디폴트 메서드를 호출하는 방법은 다음과 같다.
 * 
 * 부모 인터페이스명.super.디폴트 메서드명
 * 
 * 다음 코드를 살펴보자. 
 */

interface A{
	default void abc() {
		System.out.println("인터페이스 A의 abc()");
	}
}

class B implements A{
	public void abc() {
		A.super.abc();
		System.out.println("B 클래스의 abc()");
	}
}

/**
 * 자식 클래스 B의 메서드 abc() 메서드 내에서 A.super.abc() 와 같이 부모 인터페이스의
 * 디폴트 메서드를 먼저 호출했다 따라서 다음과 같이 자식 클래스의 객체를 생성하고 메서드를
 * 호출하면 A 인터페이스의 abc가 먼저 호출되고 이어서 B의 클래스의 abc가 호출된다. 
 * 
 * 여기서는 부모의 메서드를 호출하는 방식이 클래스와 조금 다르다는 것을 알 수 있다. 부코 클래스의
 * 메서드를 호출할 때는 super.부모메서드명 인데 부모 인터페이스의 메서드를 호출할 때는
 * super 앞에 인터페이스 명까지 붙는다 부모가 클래스이든 인터페이스이든
 * 그냥 super.부모 메서드명으로 통일하면 편할 텐데 이렇게 다른 방식을 사용하는 이유는
 * 인터페이스는 다중 상속을 할 수 있으므로 부모 인터페이스가 여럿일 수 있기 때문이다. 
 * 앞에서 모든 자바의 클래스는 Object 클래스를 상속한다고 했다. 만일 아무런 클래스도 상속 하지 
 * 않으면 컴파일러는 자동으로 Object 클래스를 상속하는 구문을 추가한다. 
 * 
 * 이때 예를 들어 클래스 C는 부모가 셋(Object,A,B)이 생긴 셈이다. 클래스는 어차피
 * 다중 상속을 할 수 없으므로 부모 클래스를 구분 지을 필요 없이 super.부모 메서드명 처럼
 * 호출 하면 될 것이다. 하지만 인터페이스는 다중상속이 되므로 어떤 부모 인터페이스 
 * 내부에 메서드를 호출하라는 소리인지 구분할 필요가 있다. 그래서 인터페이스 내의 메서드를 호출할 
 * 때는 부모 인터페이스명.super.부모 메서드명 처럼 호출하는 것이다. 
 */


/**
 * 자바 8 이후부터 추가된 인터페이스의 두 번째 기능은 static 메서드를 포함할 수 있다는
 * 것이다 이는 클래스 내부의 정적 메서드와 동일한 기능으로 다음과 같이 객체를 생성하지 않고
 * 인터페이스명.정적 메서드명의 방식으로 바로 호출할 수 있다.
 */

interface A1 {
	static void abc() {
		System.out.println("인터페이스 A1의 정적 메서드 ");
	}
}

public class 인터페이스12_2_5_2 {
	public static void main(String[] args) {
		A b = new B();
		b.abc();
		A1.abc();
	}
}
