package 토2026_09_26_1;

/**
 * 12.2.5 디폴트 메서드와 정적 메서드
 * 
 * 자바 8이 등장하면서 인터페이스에 몇 가지 기능이 추가됐다 그 첫 번째가 인터페이스 내에
 * 완성된 메서드인 디폴트 메서드가 포함될 수 있다는 것이다. 
 * 디폴트 메서드는 다음과 같이 리턴타입 앞에 public default를 붙어 표기한다.
 */

interface 예1 {
	public default int abc() {
		return 0;
	}
}

/**
 * 인터페이스 내의 필드 또는 추상 메서드처럼 디폴트 메서드 앞에 접근 지정자 public을 
 * 생략해도 컴파일러가 자동으로 삽입한다 그러면 인터페이스 내부에 디폴트 메서드가 추가된
 * 배경을 알아보자 인터페이스 A를 클래스 B ~ 클래스 F에서 상속해 사용하고
 * 있다고 가정해 보자. 
 * 
 * 여기서는 5개의 자식 클래스를 고려하지만 대략 100개의 자식 클래스가 있다고 가정해 보자
 * 이때 필요에 따라 인터페이스 내에 메서드를 1개 더 축하ㅏ면 이전에 만들어 사용하던 모든 
 * 자식 클래스에서 오류가 발생할 것이다 그 이유는 당연히 새롭게 추가된 메서드를 구현하지 않았기 
 * 때문이다. 자바 8 이전에는 과거의 자식 클래스들을 그대로 사용하기 위해
 * 인터페이스를 새롭게 정의해 사용할 수 밖에 없었다. 이 문제점을 해결하기 위한 방법이
 * 디폴트 메서드로 인터페이스 내부에 완성된 메서드를 삽입하는 것이다. 디폴트 메서드는 
 * 다음 예와 같이 이미 완성된 메서드이므로 자식 클래스는 이 메서드를 반드시 오버라이딩할
 * 의무가 없는 것이다. 
 * 
 * 디폴트 메서드는 심지어 일반 메서드처럼 자식 클래스에서 오버라이딩해 사용할 수도 있다. 
 * 
 * 다음 예를 살펴보자 인터페이스 A에는 추상 메서드 1개 와 디폴트 메서드 1개가 있다 
 * 클래스 B에서는 인터페이스 A를 상속받아 추상 메서드를 구현했으며 클래스 C에서는
 * 추상 메서드의 구현을 물론 인터페이스 A의 디폴트 메서드까지 오버라이딩 했다
 * 오버라이딩 과정을 살펴보면 일반 클래스에서 완성된 메서드를 상속할 때와 동일하게 
 * 동작하는 것을 알 수 있다. 인터페이스 내에 완성된 메서드인 디폴트 메서드는 비록 완성된
 * 형태이긴 하지만 인터페이스 자체가 여전히 객체를 생성할 수 없는 상태이므로 
 * 디폴트 메서드를 실행하기 위해서는 일단 상속시켜야 한다는 점을 기억하자. 
 */

interface A{
	void abc();
	default void bcd() {
		System.out.println("인터페이스 A의 bcd()");
	}
}

class B implements A{
	public void abc() {
		System.out.println("클래스 B의 abc()");
	}
}

class C implements A{
	public void abc() {
		System.out.println("클래스 C의 abc()");
	}
	public void bcd() {
		System.out.println("클래스 C의 bcd()");
	}
}

public class 인터페이스12_2_5 {

	public static void main(String[] args) {
		A c = new C();
		A b = new B();
		
		b.bcd();
		b.abc();
		c.abc();
		c.bcd();
		
	}

}
