package 금요일2026_08_28;

public class static_제어자 {

	public static void main(String[] args) {
		/**
		 * static은 클래스의 멤버(필드,메서드,이너클래스)에 사용하는 제어자다.
		 * 이제까지 클래스의 멤버를 다른 클래스 내에서 사용하기 위해서는 가장 먼저 클래스의 객체를 생성해야 한다고 했다.
		 * 이렇게 객체 안에 있을때 사용할 수 있는 상태가 되는 멤버를 인스턴스 멤버라고 한다.
		 * 쉽게 말해 인스턴스 멤버는 멤버 앞에 static이 붙어 있지 않은 것을 말한다.
		 * 반면 앞에 static이 붙어 있는 멤버를 정적 멤버 라고 한다. 
		 * 정적 멤버의 가장 큰 특징은 객체의 생성 없이 '클래스명.멤버명' 만으로 바로 사용할 수 있다는 것이다.
		 * 정적 멤버도 인스턴스 멤버처럼 객체를 먼저 생성한 후 참조 변수명.멤버명 과 같이 사용할 수 있지만. 그렇게 사용할 것이라면
		 * 애초에 정적 멤버로 만들 필요도 없을 것이다.
		 * 또한 호출된 모양만으로 정적 멤버라는 것을 분명히 알 수 있도록 가능한 한 정적 멤버는 클래스명.멤버명 의 형태로 사용하길 권장한다.
		 */
	}

}
